{
  "version": "https://jsonfeed.org/version/1",
  "title": "Spencer Sharp",
  "feed_url": "undefined/rss/feed.json",
  "description": "Your blog description",
  "icon": "undefined/favicon.ico",
  "author": {
    "name": "Spencer Sharp"
  },
  "items": [
    {
      "id": "undefined/articles/1000-days-of-code",
      "content_html": "<p>100DaysOfCode - популярный челендж для новичков, чтобы выучить язык и написать свои первые приложения. Я хотел к нему приступить, но не достаточно сильно, чтобы приступить:)\nОснованя мотивация этого челенджа в том, что человек не забросил кодинг. Мне это не грозило, поэтому и сам челендж не был интересен.</p>\n<p>Но! 1000DaysOfCode - эта мысль, которая меня зацепила.\n1000 дней = 2 года и 9 месяцев.\nЕсли работать разработчиком, и каждый день уделять, минимум 1 час тому, чтобы учиться, то это будет 1000 часов.\n1000 = 41.5 день чистого времени.\nА если 5 дней в неделю учиться по 2 часа и 2 по 1?\nЭто уже примерно 1714 часов или 71 день.\nПримерно 2 месяца и 10 дней чистого времени на обучение.\nНа мой взгляд, это очень много!</p>\n<h2>Но зачем?</h2>\n<p>Я пришел к выводу, что начать кодить несложно. И наблюдение за миром вокруг это подтверждает. Намного сложнее быстро и эффективно расти. Цель этого челленджа в том, чтобы за 2.5 года добиться максимально хороших результатов.</p>\n<p>Сейчас у меня настал момент, когда я смог оценить насколько много я все-таки не знаю… И часть этого незнания я точно хочу закрыть. Такой челлендж точно поможет.</p>\n<p>Работа в АйТи сама по себе требует постоянного изучения. Я просто формализую этот процесс.</p>\n<p>Правила и что надо делать?\nУ меня есть набор тем для изучения. Это могут быть языки, фреймворки или программы.\nУ меня есть время выделенное под обучение:\nВ будни по 2 часа до работы.\nВ выходные 1 час.</p>\n<p>В будни я прохожу такое обучение, которое предполагает написание кода.\nВ выходные я код не пишу. Слушаю подкасты, читаю книги или статьи…</p>\n<p>У меня есть 7 слотов под темы для изучения по количеству дней. Каждый отдельный день я изучаю одну тему.\nЯ могу отдать под одну тему от 1 до 5 дней в неделю. То есть 5 дней в неделю изучаю только React, а по выходным работу с Ansible. Или Сегодня Rust, завтра MongoDB, послезавтра nvim.</p>\n<p>Каждый день делается коммит в специальное репо с заметкой в md о что я изучал сегодня. Также в этом репо может храниться код, заметки и т.д. И также должен делать пост в твиттер с хэштегом:)\nКаждую неделю выходит статья или видео-ролик связанный с теме или темами, которые я изучал за неделю. Но это не обязательно про обучение, может быть просто фан-котент, в котором косвенно затрагивается пройденный материал.</p>\n<h3>Основная тема.</h3>\n<p>На все время выбирается одна основная тема. Ее я должен изучать каждую неделю, минимум, один день. Ее нельзя убрать, заменить и т.д.\nВ моем случае - это JavaScript. Это должно быть что-то, что напрямую относится к JS.</p>\n<h3>Дополнительные темы.</h3>\n<p>Это может быть что угодно, сколько угодно, можно менять, убирать и забрасывать.</p>\n<p><strong>Челлендж начинается 1 июня 2022 года.</strong>\n<strong>Заканчивается 25 февраля 2025 года.</strong></p>",
      "url": "undefined/articles/1000-days-of-code",
      "title": "#1000DaysOfCode",
      "summary": "Мне не было интересно выполнять 100 дней кода, но вот 1000 - другое дело!",
      "date_modified": "2022-05-26T00:00:00.000Z",
      "author": {
        "name": "Spencer Sharp"
      }
    }
  ]
}
